package org.example.data

class CitiesList {

    val cities: MutableList<String> = mutableListOf( "Київ", "Харків", "Одеса", "Дніпро", "Донецьк",
        "Запоріжжя", "Львів", "Кривий Ріг", "Миколаїв", "Маріуполь",
        "Вінниця", "Херсон", "Полтава", "Чернігів", "Черкаси",
        "Житомир", "Суми", "Івано-Франківськ", "Кам'янське", "Кропивницький",
        "Тернопіль", "Хмельницький", "Рівне", "Чернівці", "Кременчук",
        "Луцьк", "Біла Церква", "Краматорськ", "Мелітополь", "Керч",
        "Ужгород", "Бердянськ", "Севастополь", "Нікополь", "Херсон",
        "Славутич", "Ізмаїл", "Бровари", "Павлоград", "Хуст",
        "Хмільник", "Мукачево", "Сміла", "Боярка", "Острог",
        "Долина", "Шацьк", "Почаїв", "Пісочин", "Самбір")

    val usedCities: MutableList<String> = mutableListOf()

    fun markCityAsUsed(city: String) = usedCities.add(city)

    fun cleanUsedCitiesList() = usedCities.clear()
}
